{
    "person": {
        "role": "Software Engineer"
    },
    "newsletter": {
        "title": "Subscribe to {firstName}'s Newsletter",
        "description": "I occasionally write about design, technology, and share thoughts on the intersection of creativity and engineering",
        "button": "Sign up"
    },
    "home": {
        "label": "Home",
        "title": "{name}'s Portfolio",
        "description": "Portfolio website showcasing my work as a {role}",
        "headline": "Software Engineer and Data Science researcher",
        "subline": "Juan is a Software Engineer with over 9 years of experience in full-stack development, data science, and cloud computing. He excels in leading technical projects, optimizing software performance, and applying machine learning to real-world agricultural challenges."
    },
    "about": {
        "label": "About",
        "title": "About me",
        "description": "Meet {name}, {role} from {location}",
        "intro": {
            "title": "Introduction",
            "description": "Juan is a Software Engineer with over 8 years of experience in full-stack development, data science, and cloud computing. He excels in leading technical projects, optimizing software performance, and applying machine learning to real-world agricultural challenges."
        },
        "work": {
            "title": "Work Experience",
            "experiences": {
                "SoilNetLLC": {
                    "timeframe": "Aug 2024 – Present",
                    "role": "Data Science Project Supervisor",
                    "achievements": "Led the \"Digital Agronomist\" project's technical development, guiding frontend (React), backend (Node.js), database (MariaDB), and Python ETL implementations.;Applied statistical and machine learning methods to improve the accuracy of nutrient predictions (e.g., nitrogen, phosphorus, potassium) and integrated weather data for a holistic view on nutrient management.;Refined data cleaning and processing techniques to ensure high-quality datasets for agronomic modeling."
                },
                "RuedataInc": {
                    "timeframe": "April 2025 – Jul 2025",
                    "role": "Sr. Frontend Engineer",
                    "achievements": "Participated on the system, project design and development of the new Rue Lite Mobile App for Android and iOS using React Native;Supported decision making for the Rue Lite Mobile app product."
                },
                "SoilNetLLCResearcher": {
                    "timeframe": "May 2024 – Aug 2024",
                    "role": "Researcher (Soil Science and Agronomy)",
                    "achievements": "Conducted research for the \"Digital Agronomist\" project while awaiting STEM OPT authorization.;Mentored interns on data science solutions, covering database design, API integrations, and predictive models for agronomy."
                },
                "UniversityOfWisconsinWhitewater": {
                    "timeframe": "Aug 2022 – Aug 2024",
                    "role": "Graduate Assistant",
                    "achievements": "Mentored 20+ students in Python programming courses, enhancing their skills in programming projects.;Graded and reviewed over 500 labs and assignments, providing constructive feedback to support student learning."
                },
                "UruIT": {
                    "timeframe": "Nov 2020 – Apr 2022",
                    "role": "Sr. Full Stack Developer",
                    "achievements": "Developed a high-performance login widget using the Native Web Components API, compatible with React and Vue projects.;Reduced technical debt by 60% with a cross-framework solution, enabling faster deployment and streamlined maintenance."
                },
                "BunnyStudio": {
                    "timeframe": "Jun 2019 – Oct 2020",
                    "role": "Sr. Full Stack Engineer",
                    "achievements": "Rebuilt a legacy AngularJS UI system with ReactJS & NextJS, improving page load times by 80% and boosting user engagement.;Resolved critical bugs in systems using Node.js, PHP, Python, and Elixir, and improved code quality through comprehensive reviews."
                },
                "VIGPROSAS": {
                    "timeframe": "Jun 2018 – Jun 2019",
                    "role": "Sr. Full Stack Developer",
                    "achievements": "Designed a PostgreSQL database and backend with Ruby on Rails and Node.js, optimizing API integrations and reducing costs.;Led three cross-functional teams, ensuring high-quality code and best practices across Ruby, JavaScript, and PHP projects.;Automated CI/CD pipelines for AWS, improving deployment reliability and reducing release times."
                },
                "ImaginamosDigitalAgency": {
                    "timeframe": "Dec 2017 – May 2018",
                    "role": "Full Stack Developer",
                    "achievements": "Developed a high-performance e-commerce platform with NextJS and Redux, boosting online sales for La 14 supermarket.;Enhanced user experience for Cardash through dynamic UI components using React and GraphQL."
                },
                "Devhack": {
                    "timeframe": "Dec 2017 – Jul 2018",
                    "role": "Teacher of React and React Native Courses",
                    "achievements": "Instructed ReactJS courses with a focus on Redux and mobile-first design, mentoring students in modern web development practices."
                },
                "PulpoWMS": {
                    "timeframe": "Sep 2016 – Dec 2017",
                    "role": "Frontend Developer",
                    "achievements": "Developed and optimized Material Design web components for Pulpo WMS using React, Redux, and ImmutableJS."
                },
                "Creadev": {
                    "timeframe": "Jan 2015 – Sep 2016",
                    "role": "Founder / Frontend Developer",
                    "achievements": "Designed and developed web applications for startups, focusing on modern UI/UX principles, responsive design, and performance optimization.;Led frontend development using JavaScript, React, and modern web technologies to deliver scalable and maintainable solutions.;Collaborated with early-stage businesses to translate ideas into functional MVPs, guiding product development from concept to deployment."
                }
            }
        },
        "studies": {
            "title": "Studies",
            "institutions": {
                "UniversityOfWisconsinWhitewater": {
                    "description": "Master's in Computer Science."
                },
                "UniversidadCooperativaDeColombia": {
                    "description": "Software Engineering."
                }
            }
        },
        "technical": {
            "title": "Technical skills"
        }
    },
    "blog": {
        "label": "Blog",
        "title": "Writing about design and tech...",
        "description": "Read what {name} has been up to recently"
    },
    "work": {
        "label": "Work",
        "title": "My projects",
        "description": "Design and dev projects by {name}"
    },
    "gallery": {
        "label": "Gallery",
        "title": "My photo gallery",
        "description": "A photo collection by {name}"
    },
    "projectCard": {
        "label": "Read Case Study"
    }
}